# Pandas DataFrame Özellikleri & Oluşturma

In [1]:
import numpy as np
import pandas as pd
l = [1,4,577,343]
l

[1, 4, 577, 343]

In [2]:
pd.DataFrame(l, columns = ['degisken_ismi'] )

   degisken_ismi
0              1
1              4
2            577
3            343

In [3]:
df = pd.DataFrame(l, columns = ['degisken_ismi'] )

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
df.axes

[RangeIndex(start=0, stop=4, step=1), Index(['degisken_ismi'], dtype='object')]

In [6]:
df.shape

(4, 1)

In [7]:
df.ndim

2

In [8]:
df.size

4

In [9]:
df.values

array([[  1],
       [  4],
       [577],
       [343]], dtype=int64)

In [10]:
df.head()

   degisken_ismi
0              1
1              4
2            577
3            343

In [11]:
df.tail(2)

   degisken_ismi
2            577
3            343

In [12]:
a = np.array([1,2,3,4,56])

In [13]:
pd.DataFrame(a, columns = ['degisken_ismi'])

   degisken_ismi
0              1
1              2
2              3
3              4
4             56

In [14]:
m = np.arange(1,10).reshape((3,3))

In [15]:
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [16]:
pd.DataFrame(m, columns = ['var1','var2','var3'])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [17]:
df = pd.DataFrame(m, columns = ['var1','var2','var3'])

In [18]:
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [19]:
df.columns = ('deg1','deg2','deg3')

In [20]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [21]:
pd.DataFrame(m, columns = ['var1','var2','var3'], index = ['a','b','c'])

   var1  var2  var3
a     1     2     3
b     4     5     6
c     7     8     9

In [22]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [23]:
pd.DataFrame(pd.Series([1,2,3,4]), columns = ['degisken'])

   degisken
0         1
1         2
2         3
3         4

In [24]:
bir = pd.Series([1,2,3,4])
iki = pd.Series([1,2,3,4])

In [25]:
pd.DataFrame({'degisken1': bir,
             'degisken2': iki})

   degisken1  degisken2
0          1          1
1          2          2
2          3          3
3          4          4

In [26]:
sozluk = {"reg" : {"RMSE": 10,
                    "MSE": 11,
                    "SSE": 90},
          
           "loj" : {"RMSE": 89,
                    "MSE": 12,
                    "SSE": 45},
                    
          "cart": {"RMSE": 45,
                    "MSE": 22,
                    "SSE": 11}}

In [27]:
pd.DataFrame(sozluk)

      reg  loj  cart
RMSE   10   89    45
MSE    11   12    22
SSE    90   45    11

# Dataframe Eleman İşlemleri

In [28]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

df = pd.DataFrame({"var1": s1, "var2": s2,"var3": s3})
df

   var1  var2  var3
0     1     3     4
1     3     7     2
2     5     4     9
3     8     0     4
4     4     6     8

In [29]:
df[0:1]

   var1  var2  var3
0     1     3     4

In [30]:
df.index = ['a','b','c','d','e']

In [31]:
df

   var1  var2  var3
a     1     3     4
b     3     7     2
c     5     4     9
d     8     0     4
e     4     6     8

In [32]:
df['c':'e']

   var1  var2  var3
c     5     4     9
d     8     0     4
e     4     6     8

In [33]:
df.drop('a', axis = 0)

   var1  var2  var3
b     3     7     2
c     5     4     9
d     8     0     4
e     4     6     8

In [34]:
df

   var1  var2  var3
a     1     3     4
b     3     7     2
c     5     4     9
d     8     0     4
e     4     6     8

In [35]:
df.drop('a', axis = 0, inplace = True)

In [36]:
df

   var1  var2  var3
b     3     7     2
c     5     4     9
d     8     0     4
e     4     6     8

In [37]:
l = ["b","c"]

In [38]:
l

['b', 'c']

In [39]:
df.drop(l, axis = 0)

   var1  var2  var3
d     8     0     4
e     4     6     8

In [40]:
df

   var1  var2  var3
b     3     7     2
c     5     4     9
d     8     0     4
e     4     6     8

In [41]:
'var1' in df

True

In [42]:
l = ['var1','var2', 'var4']

In [43]:
for i in l:
    print(i in df)

True
True
False

In [44]:
df['var1'] is df['var1']

True

In [45]:
df['var2']

b    7
c    4
d    0
e    6
Name: var2, dtype: int32

In [46]:
df.var1

b    3
c    5
d    8
e    4
Name: var1, dtype: int32

In [47]:
df[['var1', 'var2']]

   var1  var2
b     3     7
c     5     4
d     8     0
e     4     6

In [48]:
l = ['var1', 'var2']

In [49]:
df[l]

   var1  var2
b     3     7
c     5     4
d     8     0
e     4     6

In [50]:
df

   var1  var2  var3
b     3     7     2
c     5     4     9
d     8     0     4
e     4     6     8

In [51]:
df['var4'] = df['var1'] / df['var2']

In [52]:
df

   var1  var2  var3      var4
b     3     7     2  0.428571
c     5     4     9  1.250000
d     8     0     4       inf
e     4     6     8  0.666667

In [53]:
df

   var1  var2  var3      var4
b     3     7     2  0.428571
c     5     4     9  1.250000
d     8     0     4       inf
e     4     6     8  0.666667

In [54]:
df.drop('var4', axis = 1, inplace = True)

In [55]:
df

   var1  var2  var3
b     3     7     2
c     5     4     9
d     8     0     4
e     4     6     8

In [56]:
df.drop(l, axis = 1)

   var3
b     2
c     9
d     4
e     8

## Gözlem ve Değişkenlere Birlikte Erişmek

In [57]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

df = pd.DataFrame({"var1": s1, "var2": s2,"var3": s3})
df

   var1  var2  var3
0     3     5     3
1     1     2     6
2     5     4     4
3     2     3     5
4     1     5     1

In [58]:
df.loc[0:3]

   var1  var2  var3
0     3     5     3
1     1     2     6
2     5     4     4
3     2     3     5

In [59]:
df.iloc[0:3]

   var1  var2  var3
0     3     5     3
1     1     2     6
2     5     4     4

In [60]:
df.iloc[0,0]

3

In [61]:
df.iloc[:3,:2]

   var1  var2
0     3     5
1     1     2
2     5     4

In [62]:
df.iloc[2:6,1:3]

   var2  var3
2     4     4
3     3     5
4     5     1

In [63]:
df.loc[0:3, 'var3']

0    3
1    6
2    4
3    5
Name: var3, dtype: int32

In [64]:
df.iloc[0:3, 1:3]

   var2  var3
0     5     3
1     2     6
2     4     4

In [65]:
df.index = ["a","b","c","d","e"]

In [66]:
df

   var1  var2  var3
a     3     5     3
b     1     2     6
c     5     4     4
d     2     3     5
e     1     5     1

In [67]:
df.loc["c":"d", "var2":"var3"]

   var2  var3
c     4     4
d     3     5

In [68]:
df

   var1  var2  var3
a     3     5     3
b     1     2     6
c     5     4     4
d     2     3     5
e     1     5     1

In [69]:
df[df.var1 > 5]['var2']

Series([], Name: var2, dtype: int32)

In [70]:
df[(df.var1 > 5) & (df.var3 < 7)]

Empty DataFrame
Columns: [var1, var2, var3]
Index: []

In [71]:
df.loc[df.var1 > 5, ['var2','var1']]

Empty DataFrame
Columns: [var2, var1]
Index: []

## Birleştirme (Join) İşlemleri

In [72]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

df1 = pd.DataFrame({"var1": s1, "var2": s2,"var3": s3})
df1

   var1  var2  var3
0     8     2     5
1     1     1     9
2     2     1     4
3     8     1     2
4     9     4     0

In [73]:
df2 = df1 + 99
df2

   var1  var2  var3
0   107   101   104
1   100   100   108
2   101   100   103
3   107   100   101
4   108   103    99

In [74]:
import pandas as pd
pd.concat([df1,df2], axis = 1)

   var1  var2  var3  var1  var2  var3
0     8     2     5   107   101   104
1     1     1     9   100   100   108
2     2     1     4   101   100   103
3     8     1     2   107   100   101
4     9     4     0   108   103    99

In [75]:
pd.concat([df1,df2])

   var1  var2  var3
0     8     2     5
1     1     1     9
2     2     1     4
3     8     1     2
4     9     4     0
0   107   101   104
1   100   100   108
2   101   100   103
3   107   100   101
4   108   103    99

In [76]:
pd.concat([df1,df2], ignore_index = True)

   var1  var2  var3
0     8     2     5
1     1     1     9
2     2     1     4
3     8     1     2
4     9     4     0
5   107   101   104
6   100   100   108
7   101   100   103
8   107   100   101
9   108   103    99

In [77]:
df2.columns = ["var1","var2","deg3"]

In [78]:
df2

   var1  var2  deg3
0   107   101   104
1   100   100   108
2   101   100   103
3   107   100   101
4   108   103    99

In [79]:
df1

   var1  var2  var3
0     8     2     5
1     1     1     9
2     2     1     4
3     8     1     2
4     9     4     0

In [80]:
pd.concat([df1,df2])

C:\Users\BAHAR\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    deg3  var1  var2  var3
0    NaN     8     2   5.0
1    NaN     1     1   9.0
2    NaN     2     1   4.0
3    NaN     8     1   2.0
4    NaN     9     4   0.0
0  104.0   107   101   NaN
1  108.0   100   100   NaN
2  103.0   101   100   NaN
3  101.0   107   100   NaN
4   99.0   108   103   NaN

In [81]:
pd.concat([df1,df2], join = 'inner')

   var1  var2
0     8     2
1     1     1
2     2     1
3     8     1
4     9     4
0   107   101
1   100   100
2   101   100
3   107   100
4   108   103

In [82]:
pd.concat([df1,df2], join_axes = [df1.columns])

C:\Users\BAHAR\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

   var1  var2  var3
0     8     2   5.0
1     1     1   9.0
2     2     1   4.0
3     8     1   2.0
4     9     4   0.0
0   107   101   NaN
1   100   100   NaN
2   101   100   NaN
3   107   100   NaN
4   108   103   NaN

In [83]:
#merge join

In [84]:
df1 = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'grup': ['Muhasebe', 'Muhendislik', 'Muhendislik', 'İK']})

df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [85]:
df2 = pd.DataFrame({'calisanlar': ['Ayse', 'Ali', 'Veli', 'Fatma'],
                    'ilk_giris': [2010, 2009, 2014, 2019]})

df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [86]:
pd.merge(df1, df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [87]:
pd.merge(df1, df2, on = 'calisanlar')

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [88]:
df3 = pd.merge(df1,df2)

In [89]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [90]:
df4 = pd.DataFrame({'grup': ['Muhasebe', 'Muhendislik', 'İK'],
                    'mudur': ['Caner', 'Mustafa', 'Berkcan']})

df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [91]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           İK       2019  Berkcan

In [92]:
df5 = pd.DataFrame({'grup': ['Muhasebe', 'Muhasebe',
                              'Muhendislik', 'Muhendislik', 'İK', 'İK'],
                    'yetenekler': ['matematik', 'excel', 'kodlama', 'linux',
                               'excel', 'yonetim']})

df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [93]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [94]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim

In [95]:
df3 = pd.DataFrame({'name': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'maas': [70000, 80000, 120000, 90000]})

df3

    name    maas
0    Ali   70000
1   Veli   80000
2   Ayse  120000
3  Fatma   90000

In [96]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [97]:
pd.merge(df1,df3, left_on = 'calisanlar', right_on = 'name')

  calisanlar         grup   name    maas
0        Ali     Muhasebe    Ali   70000
1       Veli  Muhendislik   Veli   80000
2       Ayse  Muhendislik   Ayse  120000
3      Fatma           İK  Fatma   90000

In [98]:
pd.merge(df1,df3, left_on = 'calisanlar', right_on = 'name').drop('name', axis =1)

  calisanlar         grup    maas
0        Ali     Muhasebe   70000
1       Veli  Muhendislik   80000
2       Ayse  Muhendislik  120000
3      Fatma           İK   90000

In [99]:
df1a = df1.set_index('calisanlar')

In [100]:
df1a

                   grup
calisanlar
Ali            Muhasebe
Veli        Muhendislik
Ayse        Muhendislik
Fatma                İK

In [101]:
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [102]:
df2a = df2.set_index('calisanlar')
df2a

            ilk_giris
calisanlar
Ayse             2010
Ali              2009
Veli             2014
Fatma            2019

In [103]:
pd.merge(df1a, df2a, left_index = True, right_index = True)

                   grup  ilk_giris
calisanlar
Ali            Muhasebe       2009
Veli        Muhendislik       2014
Ayse        Muhendislik       2010
Fatma                İK       2019

In [104]:
df1a.join(df2a)

                   grup  ilk_giris
calisanlar
Ali            Muhasebe       2009
Veli        Muhendislik       2014
Ayse        Muhendislik       2010
Fatma                İK       2019

In [105]:
dfa = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'siralama': [1, 2, 3, 4]})

dfa

  calisanlar  siralama
0        Ali         1
1       Veli         2
2       Ayse         3
3      Fatma         4

In [106]:
dfb = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'siralama': [3, 1, 4, 2]})

dfb

  calisanlar  siralama
0        Ali         3
1       Veli         1
2       Ayse         4
3      Fatma         2

In [107]:
pd.merge(dfa, dfb, on = 'calisanlar')

  calisanlar  siralama_x  siralama_y
0        Ali           1           3
1       Veli           2           1
2       Ayse           3           4
3      Fatma           4           2

In [108]:
pd.merge(dfa, dfb, on = 'calisanlar', suffixes = ["_MAAS", "_DENEYIM"])

  calisanlar  siralama_MAAS  siralama_DENEYIM
0        Ali              1                 3
1       Veli              2                 1
2       Ayse              3                 4
3      Fatma              4                 2

# Aggregation ve Gruplama İşlemleri

In [109]:
import seaborn as sns

In [110]:
df = sns.load_dataset('planets')

In [111]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [112]:
df.shape

(1035, 6)

In [113]:
df.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [114]:
df['mass'].count()

513

In [115]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

count()

first()

last()

mean()

median()

min()

max()

std()

var()

In [116]:
df['mass'].describe()

count    513.000000
mean       2.638161
std        3.818617
min        0.003600
25%        0.229000
50%        1.260000
75%        3.040000
max       25.000000
Name: mass, dtype: float64

In [117]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [118]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

## Gruplama İşlemleri

In [119]:
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'veri': [10,11,52,23,43,55]}, columns=['gruplar', 'veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [120]:
df.groupby('gruplar')

In [121]:
df.groupby('gruplar').sum()

         veri
gruplar
A          33
B          54
C         107

In [122]:
df.head()

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43

In [123]:
#df.groupby('method')['orbital_period']

In [124]:
#df.groupby('method')['orbital_period'].median()

In [125]:
#df.groupby('method')['orbital_period'].describe()

## Aggregate, filter, transform, apply

In [126]:
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [127]:
df.groupby('gruplar').aggregate(['min', np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [128]:
df.groupby('gruplar').aggregate({'degisken1': 'min', 'degisken2': 'max'})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [129]:
def filter_func(x):
    return x['degisken1'].std() > 9

In [130]:
df.groupby('gruplar').filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [131]:
df.groupby('gruplar').transform(lambda x: (x-x.mean()) / x.std())

   degisken1  degisken2
0  -0.707107  -0.707107
1   0.707107   0.707107
2  -0.707107  -0.707107
3   0.707107   0.707107
4  -0.707107  -0.707107
5   0.707107   0.707107

In [132]:
df.groupby('gruplar').apply(np.sum)
df.groupby('gruplar').apply(np.mean)

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [133]:
df.groupby(df['gruplar']).sum()

         degisken1  degisken2
gruplar
A               32        362
B               34        364
C              132       1302

In [134]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [135]:
L = [0,1,0,1,2,0]

In [136]:
df.groupby(L).sum()

   degisken1  degisken2
0        142       1402
1         45        515
2         11        111

In [137]:
df.groupby(df['gruplar']).sum()

         degisken1  degisken2
gruplar
A               32        362
B               34        364
C              132       1302

## Pivot Tablolar

In [138]:
import pandas as pd
import seaborn as sns
df = sns.load_dataset('titanic')

df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [139]:
df.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [140]:
df.groupby(['sex','class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [141]:
df.pivot_table('survived', index = 'sex', columns = 'class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [142]:
age = pd.cut(df['age'], [0,18,90])
age.head()

0    (18, 90]
1    (18, 90]
2    (18, 90]
3    (18, 90]
4    (18, 90]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [143]:
df.pivot_table('survived', ['sex',age], 'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

In [144]:
fare = pd.qcut(df['fare'],2)
fare.head()

0     (-0.001, 14.454]
1    (14.454, 512.329]
2     (-0.001, 14.454]
3    (14.454, 512.329]
4     (-0.001, 14.454]
Name: fare, dtype: category
Categories (2, interval[float64]): [(-0.001, 14.454] < (14.454, 512.329]]

In [145]:
df.pivot_table('survived', ['sex', age], [fare, 'class'])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 90]              NaN  0.880000  0.444444          0.972973
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 90]              0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 90]  0.914286  0.391304
male   (0, 18]   0.818182  0.178571
       (18, 90]  0.030303  0.192308

In [146]:
df.pivot_table(index = 'sex', columns = 'class', 
              aggfunc = {'survived' : sum, 'fare': 'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

In [147]:
df.pivot_table('survived', index = 'sex', columns = 'class', margins = True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

# R-Dplyr Tarzı Veri Manipülasyonu

In [148]:
!pip install dfply

Collecting dfply
  Downloading https://files.pythonhosted.org/packages/53/91/18ab48c64661252dadff685f8ddbc6f456302923918f488714ee2345d49b/dfply-0.3.3-py3-none-any.whl (612kB)
Requirement already satisfied: numpy in c:\users\bahar\anaconda3\lib\site-packages (from dfply) (1.16.5)
Requirement already satisfied: pandas in c:\users\bahar\anaconda3\lib\site-packages (from dfply) (0.25.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\bahar\anaconda3\lib\site-packages (from pandas->dfply) (2019.3)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\bahar\anaconda3\lib\site-packages (from pandas->dfply) (2.8.0)
Requirement already satisfied: six>=1.5 in c:\users\bahar\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas->dfply) (1.12.0)
Installing collected packages: dfply
Successfully installed dfply-0.3.3

In [149]:
from dfply import *

In [150]:
df = diamonds.copy()

df.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [151]:
df >> head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [152]:
#df >>= head()

In [153]:
df.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [154]:
df >> select(X.carat, X.cut) >> head()

   carat      cut
0   0.23    Ideal
1   0.21  Premium
2   0.23     Good
3   0.29  Premium
4   0.31     Good

In [155]:
df >> select(1, X.price, ['x','y']) >> head(3)

       cut  price     x     y
0    Ideal    326  3.95  3.98
1  Premium    326  3.89  3.84
2     Good    327  4.05  4.07

In [156]:
df >> select(columns_between('cut', 'table')) >> head(3)

       cut color clarity  depth  table
0    Ideal     E     SI2   61.5   55.0
1  Premium     E     SI1   59.8   61.0
2     Good     E     VS1   56.9   65.0

In [157]:
df >> drop(1, X.price, ['x','y']) >> head()

   carat color clarity  depth  table     z
0   0.23     E     SI2   61.5   55.0  2.43
1   0.21     E     SI1   59.8   61.0  2.31
2   0.23     E     VS1   56.9   65.0  2.31
3   0.29     I     VS2   62.4   58.0  2.63
4   0.31     J     SI2   63.3   58.0  2.75

In [158]:
df >> select(~X.carat, ~X.color) >> head()

       cut clarity  depth  table  price     x     y     z
0    Ideal     SI2   61.5   55.0    326  3.95  3.98  2.43
1  Premium     SI1   59.8   61.0    326  3.89  3.84  2.31
2     Good     VS1   56.9   65.0    327  4.05  4.07  2.31
3  Premium     VS2   62.4   58.0    334  4.20  4.23  2.63
4     Good     SI2   63.3   58.0    335  4.34  4.35  2.75

In [159]:
df >> row_slice([10])

    carat   cut color clarity  depth  table  price     x     y     z
10    0.3  Good     J     SI1   64.0   55.0    339  4.25  4.28  2.73

In [160]:
df >> group_by('cut') >> row_slice(5)

     carat        cut color clarity  depth  table  price     x     y     z
128   0.91       Fair     H     SI2   64.4   57.0   2763  6.11  6.09  3.93
20    0.30       Good     I     SI2   63.3   56.0    351  4.26  4.30  2.71
40    0.33      Ideal     I     SI2   61.2   56.0    403  4.49  4.50  2.75
26    0.24    Premium     I     VS1   62.5   57.0    355  3.97  3.94  2.47
21    0.23  Very Good     E     VS2   63.8   55.0    352  3.85  3.92  2.48

In [161]:
df >> distinct(X.color)

    carat        cut color clarity  depth  table  price     x     y     z
0    0.23      Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
3    0.29    Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4    0.31       Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
7    0.26  Very Good     H     SI1   61.9   55.0    337  4.07  4.11  2.53
12   0.22    Premium     F     SI1   60.4   61.0    342  3.88  3.84  2.33
25   0.23  Very Good     G    VVS2   60.4   58.0    354  3.97  4.01  2.41
28   0.23  Very Good     D     VS2   60.5   61.0    357  3.96  3.97  2.40

In [162]:
df >> mask(X.cut == 'Ideal') >> head()

    carat    cut color clarity  depth  table  price     x     y     z
0    0.23  Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
11   0.23  Ideal     J     VS1   62.8   56.0    340  3.93  3.90  2.46
13   0.31  Ideal     J     SI2   62.2   54.0    344  4.35  4.37  2.71
16   0.30  Ideal     I     SI2   62.0   54.0    348  4.31  4.34  2.68
39   0.33  Ideal     I     SI2   61.8   55.0    403  4.49  4.51  2.78

In [163]:
df >> filter_by(X.cut == 'Ideal', X.color == 'E', X.table < 55, X.price < 500) >> head()

       carat    cut color clarity  depth  table  price     x     y     z
26683   0.33  Ideal     E     SI2   62.2   54.0    427  4.44  4.46  2.77
32297   0.34  Ideal     E     SI2   62.4   54.0    454  4.49  4.52  2.81
40928   0.30  Ideal     E     SI1   61.6   54.0    499  4.32  4.35  2.67
50623   0.30  Ideal     E     SI2   62.1   54.0    401  4.32  4.35  2.69
50625   0.30  Ideal     E     SI2   62.0   54.0    401  4.33  4.35  2.69

In [164]:
df >> mutate(x_plus = X.x + X.y) >> select(columns_from('x')) >> head()

      x     y     z  x_plus
0  3.95  3.98  2.43    7.93
1  3.89  3.84  2.31    7.73
2  4.05  4.07  2.31    8.12
3  4.20  4.23  2.63    8.43
4  4.34  4.35  2.75    8.69

In [165]:
df >> mutate(x_plus = X.x + X.y, y_div_z = (X.y / X.z)) >> select(columns_from('x')) >> head()

      x     y     z  x_plus   y_div_z
0  3.95  3.98  2.43    7.93  1.637860
1  3.89  3.84  2.31    7.73  1.662338
2  4.05  4.07  2.31    8.12  1.761905
3  4.20  4.23  2.63    8.43  1.608365
4  4.34  4.35  2.75    8.69  1.581818

In [166]:
df >> transmute(x_plus = X.x + X.y, y_div_z = (X.y / X.z)) >> head()

   x_plus   y_div_z
0    7.93  1.637860
1    7.73  1.662338
2    8.12  1.761905
3    8.43  1.608365
4    8.69  1.581818

In [167]:
df >> head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [168]:
df >> group_by(X.cut) >> arrange(X.price) >> ungroup() >> mask(X.carat < 0.23)

       carat        cut color clarity  depth  table  price     x     y     z
8       0.22       Fair     E     VS2   65.1   61.0    337  3.87  3.78  2.49
31595   0.20      Ideal     E     VS2   59.7   55.0    367  3.86  3.84  2.30
31597   0.20      Ideal     D     VS2   61.5   57.0    367  3.81  3.77  2.33
31599   0.20      Ideal     E     VS2   62.2   57.0    367  3.76  3.73  2.33
1       0.21    Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
12      0.22    Premium     F     SI1   60.4   61.0    342  3.88  3.84  2.33
14      0.20    Premium     E     SI2   60.2   62.0    345  3.79  3.75  2.27
31591   0.20    Premium     E     VS2   59.8   62.0    367  3.79  3.77  2.26
31601   0.20    Premium     D     VS2   61.7   60.0    367  3.77  3.72  2.31
31592   0.20    Premium     E     VS2   59.0   60.0    367  3.81  3.78  2.24
31593   0.20    Premium     E     VS2   61.1   59.0    367  3.81  3.78  2.32
31600   0.20    Premium     D     VS2   62.3   60.0    367  3.73  3.68  2.31
31596   0.20    Premium     F     VS2   62.6   59.0    367  3.73  3.71  2.33
31594   0.20    Premium     E     VS2   59.7   62.0    367  3.84  3.80  2.28
38279   0.21    Premium     D     VS2   58.3   59.0    386  3.96  3.93  2.30
38278   0.21    Premium     D     VS2   59.1   62.0    386  3.89  3.86  2.29
38277   0.21    Premium     D     VS2   60.6   60.0    386  3.85  3.81  2.32
38276   0.21    Premium     D     VS2   61.6   59.0    386  3.82  3.78  2.34
38275   0.21    Premium     E     VS2   59.6   56.0    386  3.93  3.89  2.33
38274   0.21    Premium     E     VS2   60.5   59.0    386  3.87  3.83  2.33
43989   0.21    Premium     E     SI2   61.9   56.0    394  3.84  3.82  2.37
53      0.22    Premium     E     VS2   61.6   58.0    404  3.93  3.89  2.41
54      0.22    Premium     D     VS2   59.3   62.0    404  3.91  3.88  2.31
34611   0.22    Premium     F     SI1   61.7   60.0    470  3.90  3.85  2.39
31598   0.20  Very Good     E     VS2   63.4   59.0    367  3.74  3.71  2.36
38273   0.21  Very Good     E     VS2   63.2   54.0    386  3.82  3.78  2.40

In [169]:
df >> summarize(price_ortalama = X.price.mean(), price_ss =  X.price.std())

   price_ortalama     price_ss
0     3932.799722  3989.439738

In [170]:
df >> group_by('cut') >> summarize(price_ortalama = X.price.mean(), price_ss =  X.price.std())

         cut  price_ortalama     price_ss
0       Fair     4358.757764  3560.386612
1       Good     3928.864452  3681.589584
2      Ideal     3457.541970  3808.401172
3    Premium     4584.257704  4349.204961
4  Very Good     3981.759891  3935.862161

## Dış Kaynaklı Verileri Okuma

In [171]:
pwd

'C:\\Users\\BAHAR\\UDEMY\\veri_manipulasyonu'

In [172]:
import pandas as pd

In [173]:
pd.read_csv('reading_data/ornekcsv.csv', sep = ";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [174]:
pd.read_csv('reading_data/duz_metin.txt')

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [175]:
pd.read_excel('reading_data/ornekx.xlsx')

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0